In [1]:
'''
create a dataframe which contains only integers with 3 row and 2 columns. 
run the following dataframe methods on them:
describe()
mean()
corr()
count()
max()
min()
median()
std()
drop()
loc()
iloc()
'''

'\ncreate a dataframe which contains only integers with 3 row and 2 columns. \nrun the following dataframe methods on them:\ndescribe()\nmean()\ncorr()\ncount()\nmax()\nmin()\nmedian()\nstd()\ndrop()\nloc()\niloc()\n'

In [2]:
import numpy as np
import pandas as pd

In [5]:
df = pd.DataFrame({
    'A': [11,12,13],
    'B': [44,45,46]
})

In [6]:
df

    A   B
0  11  44
1  12  45
2  13  46

In [7]:
df.describe()

          A     B
count   3.0   3.0
mean   12.0  45.0
std     1.0   1.0
min    11.0  44.0
25%    11.5  44.5
50%    12.0  45.0
75%    12.5  45.5
max    13.0  46.0

In [8]:
df.mean()

A    12.0
B    45.0
dtype: float64

In [9]:
df.corr()

     A    B
A  1.0  1.0
B  1.0  1.0

In [10]:
df.count()

A    3
B    3
dtype: int64

In [11]:
df.max()

A    13
B    46
dtype: int64

In [12]:
df.max(axis=1)

0    44
1    45
2    46
dtype: int64

In [15]:
df.min()

A    11
B    44
dtype: int64

In [16]:
df.std()

A    1.0
B    1.0
dtype: float64

In [17]:
df.median()

A    12.0
B    45.0
dtype: float64

In [22]:
df.drop(index=1)

    A   B
0  11  44
2  13  46